src/cf/Enums/ItobПоказательКоординат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ItobПоказательКоординат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Скорость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Направление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПревышениеСкоростиОтносительноПДД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ItobДинамическиеОтборыПовтИсп/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ДоступныеПоказателиКоординат() Экспорт
	
	ПоказателиКоординат = Новый Структура;
	ПоказателиКоординат.Вставить("Направление", Перечисления.ItobПоказательКоординат.Направление); 
	ПоказателиКоординат.Вставить("Скорость", Перечисления.ItobПоказательКоординат.Скорость);
	ПоказателиКоординат.Вставить("ПревышениеСкоростиОтносительноПДД", Перечисления.ItobПоказательКоординат.ПревышениеСкоростиОтносительноПДД);
	
	
	Возврат ПоказателиКоординат;
	
КонецФункции
 

#КонецОбласти
